HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCpu_regdef.h
/** \\brief  CPU Code Protection Range Upper Bound Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_CPR_U_Bits B;
} Ifx_CPU_CPR_U;

/** \\brief  CPU Identification Register TC1.6P */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_CPU_ID_Bits B;
} Ifx_CPU_CPU_ID;

/** \\brief  CPU Code Protection Execute Enable Register Set */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_CPXE_Bits B;
} Ifx_CPU_CPXE;

/** \\brief  Core Register Access Event */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_CREVT_Bits B;
} Ifx_CPU_CREVT;

/** \\brief  CPU Customer ID register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_CUS_ID_Bits B;
} Ifx_CPU_CUS_ID;

/** \\brief  Data General Purpose Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_D_Bits B;
} Ifx_CPU_D;

/** \\brief  Data Asynchronous Trap Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DATR_Bits B;
} Ifx_CPU_DATR;

/** \\brief  Debug Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DBGSR_Bits B;
} Ifx_CPU_DBGSR;

/** \\brief  Debug Trap Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DBGTCR_Bits B;
} Ifx_CPU_DBGTCR;

/** \\brief  Data Memory Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DCON0_Bits B;
} Ifx_CPU_DCON0;

/** \\brief  Data Control Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DCON2_Bits B;
} Ifx_CPU_DCON2;

/** \\brief  Debug Context Save Area Pointer */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DCX_Bits B;
} Ifx_CPU_DCX;

/** \\brief  Data Error Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DEADD_Bits B;
} Ifx_CPU_DEADD;

/** \\brief  Data Integrity Error Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DIEAR_Bits B;
} Ifx_CPU_DIEAR;

/** \\brief  Data Integrity Error Trap Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DIETR_Bits B;
} Ifx_CPU_DIETR;

/** \\brief  Debug Monitor Start Address */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DMS_Bits B;
} Ifx_CPU_DMS;

/** \\brief  CPU Data Protection Range, Lower Bound Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DPR_L_Bits B;
} Ifx_CPU_DPR_L;

/** \\brief  CPU Data Protection Range, Upper Bound Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DPR_U_Bits B;
} Ifx_CPU_DPR_U;

/** \\brief  CPU Data Protection Read Enable Register Set */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DPRE_Bits B;
} Ifx_CPU_DPRE;

/** \\brief  CPU Data Protection Write Enable Register Set */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DPWE_Bits B;
} Ifx_CPU_DPWE;

/** \\brief  Data Synchronous Trap Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_DSTR_Bits B;
} Ifx_CPU_DSTR;

/** \\brief  External Event Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_EXEVT_Bits B;
} Ifx_CPU_EXEVT;

/** \\brief  Free CSA List Head Pointer */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_FCX_Bits B;
} Ifx_CPU_FCX;

/** \\brief  CPU Trap Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_FPU_TRAP_CON_Bits B;
} Ifx_CPU_FPU_TRAP_CON;

/** \\brief  CPU Trapping Instruction Opcode Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_FPU_TRAP_OPC_Bits B;
} Ifx_CPU_FPU_TRAP_OPC;

/** \\brief  CPU Trapping Instruction Program Counter Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_FPU_TRAP_PC_Bits B;
} Ifx_CPU_FPU_TRAP_PC;

/** \\brief  CPU Trapping Instruction Operand Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_FPU_TRAP_SRC1_Bits B;
} Ifx_CPU_FPU_TRAP_SRC1;

/** \\brief  CPU Trapping Instruction Operand Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_FPU_TRAP_SRC2_Bits B;
} Ifx_CPU_FPU_TRAP_SRC2;

/** \\brief  Trapping Instruction Operand Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_FPU_TRAP_SRC3_Bits B;
} Ifx_CPU_FPU_TRAP_SRC3;

/** \\brief  Instruction Count */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_ICNT_Bits B;
} Ifx_CPU_ICNT;

/** \\brief  Interrupt Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_ICR_Bits B;
} Ifx_CPU_ICR;

/** \\brief  Interrupt Stack Pointer */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_ISP_Bits B;
} Ifx_CPU_ISP;

/** \\brief  Free CSA List Limit Pointer */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_LCX_Bits B;
} Ifx_CPU_LCX;

/** \\brief  Multi-Count Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_M1CNT_Bits B;
} Ifx_CPU_M1CNT;

/** \\brief  Multi-Count Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_M2CNT_Bits B;
} Ifx_CPU_M2CNT;

/** \\brief  Multi-Count Register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_M3CNT_Bits B;
} Ifx_CPU_M3CNT;

/** \\brief  Program Counter */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CPU_PC_Bits B;
} Ifx_CPU_PC;

